import '../personal-data/personal-data.scss'

const DogovorOfert = () => {
    return (
        <main>
            <section className='container-fluid'>
                <div className='personal__title'>Договор оферты</div>
                <div className='personal__text'>
                    Интернет-магазин "ЦветНик" (далее – «Интернет-магазин»), расположенный по адресу
                    https://cvetnik-kzn.ru, в лице ИП Астафьевой Натальи Александровны (далее – «Продавец»),
                    действующего на основании свидетельства, публикует Публичную оферту о продаже Товара дистанционным
                    способом.
                    <p className='personal__title-small'>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</p>
                    1.1. Публичная оферта (далее – «Оферта») – публичное предложение Продавца, адресованное
                    неопределенному кругу лиц, заключить с Продавцом договор купли-продажи товара дистанционным способом
                    (далее – «Договор») на условиях, содержащихся в настоящей Оферте, включая все Приложения.
                    <br />
                    1.2. Заказ Товара на сайте Интернет-магазина – позиции, указанные Покупателем из ассортимента
                    Товара, предложенного к продаже, при оформлении заявки на приобретение Товара на сайте
                    Интернет-магазина или через Оператора.
                    <br />
                    <p className='personal__title-small'>2. ОБЩИЕ ПОЛОЖЕНИЯ</p>
                    2.1. Заказ Покупателем Товара, размещенного на сайте Интернет-магазина означает, что Покупатель
                    согласен со всеми условиями настоящей Оферты.
                    <br />
                    2.2. Администрация сайта Интернет-магазина имеет право вносить изменения в Оферту без уведомления
                    Покупателя.
                    <br />
                    2.3. Срок действия Оферты не ограничен, если иное не указано на сайте Интернет-магазина.
                    <br />
                    2.4. Продавец предоставляет Покупателю полную и достоверную информацию о Товаре, включая информацию
                    об основных потребительских свойствах Товара, месте изготовления, а также информацию о гарантийном
                    сроке и сроке годности Товара на сайте Интернет-магазина.
                    <br />
                    <p className='personal__title-small'>3. ЦЕНА ТОВАРА</p>
                    3.1. Цена на каждую позицию Товара указана на сайте Интернет-магазина.
                    <br />
                    3.2. Продавец имеет право в одностороннем порядке изменить цену на любую позицию Товара.
                    <br />
                    3.3. В случае изменения цены на заказанный Товар Продавец обязуется в течение 1 дня проинформировать
                    Покупателя об изменении цены Товара.
                    <br />
                    3.4. Покупатель вправе подтвердить либо аннулировать Заказ на приобретение Товара, если цена
                    изменена Продавцом после оформления Заказа.
                    <br />
                    3.5. Изменение Продавцом цены на оплаченный Покупателем Товар не допускается.
                    <br />
                    3.6. Продавец указывает стоимость доставки Товара на сайте Интернет-магазина либо сообщает
                    Покупателю при оформлении заказа Оператором.
                    <br />
                    3.7. Обязательства Покупателя по оплате Товара считаются исполненными с момента поступления
                    Продавцом денежных средств.
                    <br />
                    3.8. Расчеты между Продавцом и Покупателем за Товар производятся способами, указанными на сайте
                    Интернет-магазина в разделе Оплата.
                    <br />
                    <p className='personal__title-small'>4. ОФОРМЛЕНИЕ ЗАКАЗА</p>
                    4.1. Заказ Товара осуществляется Покупателем через Оператора по телефону или через сервис сайта
                    Интернет-магазина.
                    <br />
                    4.2. При заказе Товара на сайте Интернет-магазина Покупатель обязуется предоставить следующую
                    информацию:
                    <br />
                    4.2.1. фамилия, имя, отчество Покупателя и/или указанного им лица (получателя);
                    <br />
                    4.2.2. адрес, по которому следует доставить Товар (если доставка до адреса Покупателя);
                    <br />
                    4.2.3. контактный телефон.
                    <br />
                    4.3. Наименование, количество, ассортимент, цена выбранного Покупателем Товара указываются в корзине
                    Покупателя на сайте Интернет-магазина.
                    <br />
                    4.4. Если Продавцу необходима дополнительная информация, он вправе запросить ее у Покупателя. В
                    случае не предоставления необходимой информации Покупателем, Продавец не несет ответственности за
                    выбранный Покупателем Товар.
                    <br />
                    4.5. При оформлении Заказа через Оператора (п. 4.1. настоящей Оферты) Покупатель обязуется
                    предоставить информацию, указанную в п. 4.2. настоящей Оферты.
                    <br />
                    4.6. Принятие Покупателем условий настоящей Оферты осуществляется посредством внесения Покупателем
                    соответствующих данных в регистрационную форму на сайте Интернет-магазина или при оформлении Заказа
                    через Оператора. После оформления Заказа через Оператора данные о Покупателе регистрируются в базе
                    данных Продавца. Утвердив Заказ выбранного Товара, Покупатель предоставляет Оператору необходимую
                    информацию в соответствии с порядком, указанном в п. 4.2. настоящей Оферты.
                    <br />
                    4.7. Продавец не несет ответственности за содержание и достоверность информации, предоставленной
                    Покупателем при оформлении Заказа.
                    <br />
                    4.8. Покупатель несет ответственность за достоверность предоставленной информации при оформлении
                    Заказа.
                    <br />
                    4.9. Договор купли-продажи дистанционным способом между Продавцом и Покупателем считается
                    заключенным с момента выдачи Продавцом Покупателю кассового или товарного чека либо иного документа,
                    подтверждающего оплату Товара.
                    <br />
                    <p className='personal__title-small'>5. ДОСТАВКА И ПЕРЕДАЧА ТОВАРА ПОКУПАТЕЛЮ</p>
                    5.1. Продавец оказывает Покупателю услуги по доставке Товара одним из способов, указанных на сайте
                    Интернет-магазина в разделе Доставка.
                    <br />
                    5.2. Если Договор купли-продажи товара дистанционным способом (далее – Договор) заключен с условием
                    о доставке Товара Покупателю, Продавец обязан в установленный Договором срок доставить Товар в
                    место, указанное Покупателем.
                    <br />
                    5.3. Место доставки Товара Покупатель указывает при оформлении Заказа на приобретение Товара.
                    <br />
                    5.4. Срок доставки Товара Покупателю состоит из срока обработки заказа и срока доставки.
                    <br />
                    5.5. Доставленный Товар передается Покупателю, а при отсутствии Покупателя - любому лицу,
                    предъявившему квитанцию или иной документ, подтверждающий заключение Договора или оформление
                    доставки Товара.
                    <br />
                    <p className='personal__title-small'>6. РЕКВИЗИТЫ ПРОДАВЦА</p>
                    ИП Астафьева Наталья Александровна
                    <br />
                    ИНН 366602419808
                    <br />
                    ОГРН 316366800071541
                    <br />
                    Телефон: +7 960-048-40-19
                    <br />
                    Адрес: Казань, ул. Восстания, 67A
                    <br />
                    Внимательно ознакомьтесь с текстом публичной оферты, если Вы не согласны с каким-либо пунктом
                    оферты, Вы вправе отказаться от покупки Товаров, предоставляемых Продавцом, и не совершать действий,
                    указанный в п. 2.1. настоящей Оферты.
                    <br />
                    Согласен с договором
                </div>
            </section>
        </main>
    )
}

export default DogovorOfert
