import './personal-data.scss'

const PersonalData = () => {
    return (
        <main>
            <section className='container-fluid'>
                <div className="personal__title">Обработка персональных данных</div>
                <div className='personal__text'>
                    Настоящим я, далее – «Субъект Персональных Данных», во исполнение требований Федерального закона от
                    27.07.2006 г. № 152-ФЗ «О персональных данных» (с изменениями и дополнениями) свободно, своей волей
                    и в своем интересе даю свое согласие Интернет-магазину «Цветник» (далее – «Интернет-магазин»,
                    адрес: http://cvetnik-kzn.ru ) на обработку своих персональных данных, указанных при
                    регистрации путем заполнения веб-формы на сайте Интернет-магазина, направляемой (заполненной) с
                    использованием Сайта.<br/><br/> Под персональными данными я понимаю любую информацию, относящуюся ко мне как к
                    Субъекту Персональных Данных, в том числе мои фамилию, имя, отчество, адрес, контактные данные
                    (телефон, электронная почта, почтовый адрес), фотографии, иную другую информацию. Под обработкой
                    персональных данных я понимаю сбор, систематизацию, накопление, уточнение, обновление, изменение,
                    использование, распространение, передачу, в том числе трансграничную, обезличивание, блокирование,
                    уничтожение, бессрочное хранение, и любые другие действия (операции) с персональными данными.<br/><br/>
                    Обработка персональных данных Субъекта Персональных Данных осуществляется исключительно в целях
                    регистрации Субъекта Персональных Данных в базе данных Интернет-магазина с последующим направлением
                    Субъекту Персональных Данных почтовых сообщений и смс-уведомлений, в том числе рекламного
                    содержания, от Интернет-магазина, его аффилированных лиц и/или субподрядчиков. <br/><br/>Датой выдачи согласия
                    на обработку персональных данных Субъекта Персональных Данных является дата отправки регистрационной
                    веб-формы с Сайта Интернет-магазина.<br/><br/> Обработка персональных данных Субъекта Персональных Данных
                    может осуществляться с помощью средств автоматизации и/или без использования средств автоматизации в
                    соответствии с действующим законодательством РФ и внутренними положениями Интернет-магазина.<br/><br/>
                    Интернет-магазин принимает необходимые правовые, организационные и технические меры или обеспечивает
                    их принятие для защиты персональных данных от неправомерного или случайного доступа к ним,
                    уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных
                    данных, а также от иных неправомерных действий в отношении персональных данных, а также принимает на
                    себя обязательство сохранения конфиденциальности персональных данных Субъекта Персональных Данных.
                    Интернет-магазин вправе привлекать для обработки персональных данных Субъекта Персональных Данных
                    субподрядчиков, а также вправе передавать персональные данные для обработки своим аффилированным
                    лицам, обеспечивая при этом принятие такими субподрядчиками и аффилированными лицами соответствующих
                    обязательств в части конфиденциальности персональных данных.<br/><br/> Я ознакомлен(а), что: <br/><br/>1. настоящее
                    согласие на обработку моих персональных данных, указанных при регистрации на Сайте
                    Интернет-магазина, направляемых (заполненных) с использованием Cайта, действует в течение 20
                    (двадцати) лет с момента передачи персональных данных Администрации Интернет-магазина; <br/><br/>2. согласие
                    может быть отозвано мною на основании письменного заявления в произвольной форме; <br/><br/>3. предоставление
                    персональных данных третьих лиц без их согласия влечет ответственность в соответствии с действующим
                    законодательством Российской Федерации.
                </div>
            </section>
        </main>
    )
}

export default PersonalData
